In [1]:
import pandas as pd

# Series

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
ser[0], ser['c']

C:\Users\Admin\AppData\Local\Temp\ipykernel_10808\3588708418.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['c']

(np.int64(1), np.int64(3))

In [9]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
ser2 = pd.Series([10, 'banana'])
ser2, type(ser2)

(0        10
 1    banana
 dtype: object,
 pandas.core.series.Series)

In [18]:
population = pd.Series([9776, 2729, 1566, 3158], index=['서울', '부산', '인천', '대구'])
print(population['서울'])
print(population[['서울', '부산']])   #0번, 1번 인덱스. 팬시인덱싱

9776
서울    9776
부산    2729
dtype: int64

In [20]:
population.info()   #정보들을 확인할 수 있는 함수.

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [24]:
ser.iloc[0], ser.loc['a']   #호출자. 0번지 호출해(숫자 인덱스 가지고 꺼내), 'a'번지 호출해(인덱스 이름 가지고 꺼내)

(np.int64(1), np.int64(1))

# DataFrame

In [25]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [26]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [28]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [29]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [31]:
scientists.index = ['Rosaline Franklin', 'William Gosset']
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

iloc[]는 indexlocator -> 숫자 인덱스 꺼낼 때<br>
loc[]는 locator -> 문자 인덱스 꺼낼 때

In [33]:
scientists.loc['William Gosset']   #인덱스를 바꿔주면 해댱 인덱스로 꺼낼 수 있다.

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [36]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [47]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [48]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [37]:
data = [[1,2,3], [4,5,6], [7,8,9]]
df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
df = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['one', 'two', 'three'])
print(df)

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [45]:
print(df.loc['three']), print(df.iloc[1])

A    7
B    8
C    9
Name: three, dtype: int64
A    4
B    5
C    6
Name: two, dtype: int64

(None, None)

In [51]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [53]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [54]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [55]:
sci1.loc[0, 'Name']

'Rosaline Franklin'

In [56]:
sci1.loc[0, 'Occupation']

'Chemist'

In [58]:
sci1.to_csv('./data/scientist_1.csv')

In [ ]:
sci1.to_csv('./data/scientist_2.csv', index=False)   #인덱스는 빼고 저장

In [ ]:
# pickle : 파이썬의 객체형을 저장하는 파일. 캡슐화된 데이터
sci1.to_pickle('./data/scientist.pickle')

In [65]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [61]:
df = pd.read_csv('./data/scientist_2.csv')   #읽을 때 인덱스 붙여서 나오게 됨. 그래서 보통 저장할 땐 인덱스는 빼고 저장함
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [66]:
df3 = pd.read_csv('./data/scientists.csv')
df3

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [67]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

# 데이터 미리보기

1.

In [74]:
df3.head()   #default = 5개 처음 행 미리보기

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [75]:
df3.tail(3)   #default = 5개 마지막 행 미리보기

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [78]:
df3.describe()   #기술 통계를 낼 수 있는(숫자형) column들만

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [88]:
df3['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [86]:
df3.loc[:,'Age']   #행 지정 안해주면 Error

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [94]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [ ]:
print('=== head() ===')
print(df.head())   #처음 5개 행 보기

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

In [ ]:
print('=== tail(3) ===')
print(df.tail(3))   #마지막 3개 행 보기

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [ ]:
print('=== info() ===')
print(df.info())   #데이터프레임 기본 정보

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

In [ ]:
print('=== describe() ===')
print(df.describe())   #기술 통계량

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [99]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [100]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [101]:
df.shape

(7, 3)

In [102]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [103]:
df.columns = ['name', 'age', 'score']
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [104]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91